# Сколько элементов будет содержать список students после следующих операций?
#
# students = ['Ivan', 'Masha', 'Sasha']
# students += ['Olga']
# students += 'Olga'
#
# Введите в поле ответа одно число.
#
# Подумайте, почему так происходит. Посмотрите внимательнее на заданные операции и чем они отличаются.
#
# Если не получается решить сразу – попробуйте запустить этот код в интерпретаторе и напечатать результат, а также поэкспериментировать с оператором +=. Теперь попробуйте еще раз подумать, почему так происходит.


print(8)

